Config/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Штрихкод</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ТипыШтрихкодов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИнвентарныйНомер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Catalogs/ИнвентарныеНомераОС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ИнвентарныеНомераОС</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаводскойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеестровыйНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнойНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыпуска</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомерУОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GUIDИнвентарногоНомераУОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомерЗаимствованный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИнвентарныеНомераОС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнвентарныйНомерЗаимствуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Обременения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеЧасти</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазмерЧасти</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОбременения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрацииДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрацииНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбремененияВид</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбремененияДата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОбремененияНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Config/InformationRegisters/Штрихкоды/Forms/ФормаСозданияШтрихкодовОС/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ТипЗнч(Параметры.МассивОбъектов) = Тип("Массив") Тогда
		Если Параметры.МассивОбъектов.Количество() = 1 Тогда
			Если ТипЗнч(Параметры.МассивОбъектов[0]) <> Тип("СправочникСсылка.ОсновныеСредства") Тогда
				ВызватьИсключение(НСтр("ru = 'Команда не может быть выполнена для указанного объекта!'"));
			Иначе
				ОсновноеСредство = Параметры.МассивОбъектов[0];
			КонецЕсли;
		Иначе
			Элементы.ОсновноеСредство.Видимость = Ложь;
		КонецЕсли;
		
		ЗаполнитьТаблицуИнвНомеров(Параметры.МассивОбъектов);
	ИначеЕсли ТипЗнч(Параметры.МассивОбъектов) = Тип("Строка")
		И ЭтоАдресВременногоХранилища(Параметры.МассивОбъектов) Тогда
		
		Элементы.ОсновноеСредство.Видимость = Ложь;
		ТаблицаШтрихкодов.Загрузить(ПолучитьИзВременногоХранилища(Параметры.МассивОбъектов));
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОсновноеСредствоПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(ОсновноеСредство) Тогда
		ЗаполнитьТаблицуИнвНомеров(ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОсновноеСредство));
	Иначе
		ТаблицаШтрихкодов.Очистить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицыФормы

&НаКлиенте
Процедура ТаблицаШтрихкодовПометкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.ТаблицаШтрихкодов.ТекущиеДанные;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Штрихкод) И НЕ РазрешатьИзменятьСуществующиеШтрихкоды Тогда
		ТекущиеДанные.Пометка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПометки(Команда)
	ИзменитьПометки(Истина);
КонецПроцедуры

&НаКлиенте
Процедура СнятьПометки(Команда)
	ИзменитьПометки(Ложь);
КонецПроцедуры

&НаКлиенте
Процедура ИнвертироватьПометки(Команда)
	ИзменитьПометки(Неопределено);
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометкиВсемБезШК(Команда)
	ИзменитьПометки(Истина, Истина);
КонецПроцедуры

&НаКлиенте
Процедура СформироватьШК(Команда)
	
	СформироватьШтрихкоды();
	
	Оповестить("ЗаписьШтрихКода", Новый Структура("Объект,ТипШтрихкода",
		ОсновноеСредство, ПредопределенноеЗначение("ПланВидовХарактеристик.ТипыШтрихкодов.EAN13")));
	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЭтикеток(Команда)
	
	ОткрытьФорму("Обработка.ПечатьЭтикеток.Форма", Новый Структура("АдресТаблицыОбъектов", ПоместитьВХранилищеТаблицуОбъектов()));
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешатьИзменятьСуществующиеШтрихкодыПриИзменении(Элемент)
	
	Если Не РазрешатьИзменятьСуществующиеШтрихкоды Тогда
		СнятьПометкиСоСтрокСШК();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицуИнвНомеров(МассивОбъектов)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновныеСредства.Ссылка КАК ОсновноеСредство,
	|	ИнвентарныеНомераОС.Ссылка КАК ИнвентарныйНомер,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнвентарныеНомераОС.Ссылка, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|			ТОГДА ШтрихКоды1.Штрихкод
	|		ИНАЧЕ ШтрихКоды.Штрихкод
	|	КОНЕЦ КАК Штрихкод,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(ИнвентарныеНомераОС.Ссылка, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)
	|				И ЕСТЬNULL(ШтрихКоды1.Штрихкод, """") = """"
	|			ТОГДА ИСТИНА
	|		КОГДА ЕСТЬNULL(ШтрихКоды.Штрихкод, """") = """"
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК Пометка
	|ИЗ
	|	Справочник.ОсновныеСредства КАК ОсновныеСредства
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ИнвентарныеНомераОС КАК ИнвентарныеНомераОС
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды
	|			ПО ИнвентарныеНомераОС.Ссылка = ШтрихКоды.ИнвентарныйНомер
	|				И ИнвентарныеНомераОС.ОС = ШтрихКоды.Объект
	|				И (ШтрихКоды.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13))
	|		ПО ОсновныеСредства.Ссылка = ИнвентарныеНомераОС.ОС
	|			И ОсновныеСредства.Организация = ИнвентарныеНомераОС.Владелец
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК ШтрихКоды1
	|		ПО ОсновныеСредства.Ссылка = ШтрихКоды1.Объект
	|			И (ЕСТЬNULL(ШтрихКоды1.ИнвентарныйНомер, ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка)) = ЗНАЧЕНИЕ(Справочник.ИнвентарныеНомераОС.ПустаяСсылка))
	|			И (ШтрихКоды1.ТипШтрихкода = ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыШтрихкодов.EAN13))
	|ГДЕ
	|	ОсновныеСредства.Ссылка В ИЕРАРХИИ(&МассивОбъектов)
	|	И НЕ ОсновныеСредства.ЭтоГруппа";
	
	Результат = Запрос.Выполнить().Выгрузить();
	ТаблицаШтрихкодов.Загрузить(Результат);
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьПометки(Пометка = Неопределено, ТолькоБезШК = Ложь)
	
	Для Каждого ТекСтр Из ТаблицаШтрихкодов Цикл
		
		НовоеЗначениеПометки = ?(Пометка = Неопределено, Не ТекСтр.Пометка, Пометка);
		
		Если НовоеЗначениеПометки = Истина Тогда
			Если (ТолькоБезШК Или Не РазрешатьИзменятьСуществующиеШтрихкоды) И ЗначениеЗаполнено(ТекСтр.Штрихкод) Тогда
				НовоеЗначениеПометки = Ложь;
			КонецЕсли;
		КонецЕсли;
		
		ТекСтр.Пометка = НовоеЗначениеПометки;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СнятьПометкиСоСтрокСШК()
	
	Для Каждого ТекСтр Из ТаблицаШтрихкодов Цикл
		
		Если ЗначениеЗаполнено(ТекСтр.Штрихкод) Тогда
			ТекСтр.Пометка = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СформироватьШтрихкоды(ТолькоПустые = Ложь)
	
	МаксимальныйШтрихкод = Неопределено;
	
	Для Каждого ТекСтр Из ТаблицаШтрихкодов Цикл
		
		Если ТекСтр.Пометка И (Не ТолькоПустые Или ПустаяСтрока(ТекСтр.Штрихкод)) Тогда
			
			Запись					= РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
			Запись.Объект			= ТекСтр.ОсновноеСредство;
			Запись.ИнвентарныйНомер	= ТекСтр.ИнвентарныйНомер;
			Запись.ТипШтрихкода		= ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13;
			Запись.Штрихкод			= РегистрыСведений.ШтрихКоды.СформироватьШтрихКодEAN13(МаксимальныйШтрихКод);
			
			Запись.Записать(Не ТолькоПустые);
			
			ТекСтр.Штрихкод = Запись.Штрихкод;
			МаксимальныйШтрихкод = Запись.Штрихкод;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВХранилищеТаблицуОбъектов()
	
	Таблица = ТаблицаШтрихкодов.Выгрузить(Новый Структура("Пометка", Истина));
	Таблица.Колонки.Добавить("ТипШтрихкода");
	Таблица.ЗаполнитьЗначения(ПланыВидовХарактеристик.ТипыШтрихкодов.EAN13, "ТипШтрихкода");
	
	Возврат ПоместитьВоВременноеХранилище(Таблица, УникальныйИдентификатор);
	
КонецФункции

#КонецОбласти
